In [5]:
import pandas as pd

In [6]:
student= ["Arin",23,"CE"]
print(student)
print(type(student))

['Arin', 23, 'CE']
<class 'list'>

In [7]:
# yukarıdaki list yapısını series çevirdik.
ps_student = pd.Series(student)
print(ps_student)
print(type(ps_student))

0    Arin
1      23
2      CE
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
student = {"name":"Arin",
           "age":"23",
           "department":"CE"}
print(student)
print(type(student))

{'name': 'Arin', 'age': '23', 'department': 'CE'}
<class 'dict'>

In [9]:
# yukarıdaki dict yapısını series çevirdik.
ps_student = pd.Series(student)
print(ps_student)
print(type(ps_student))

name          Arin
age             23
department      CE
dtype: object
<class 'pandas.core.series.Series'>

In [10]:
student = pd.Series(["Arin",23,"CE"])
print(student)
print(type(student))
#kullandığımız değerlere göre dtype int float gibi tipler olabilir.

0    Arin
1      23
2      CE
dtype: object
<class 'pandas.core.series.Series'>

In [11]:
number = pd.Series([15,23,48])
print(number)
print(type(number))

0    15
1    23
2    48
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
booleans = pd.Series([True, False, True])
print(booleans)
print(type(booleans))

0     True
1    False
2     True
dtype: bool
<class 'pandas.core.series.Series'>

In [13]:
# belirlediğimiz 
student = pd.Series(data=["Arin",23,"CE"],index=["name","age","department"])
print(student)
print(type(student))
print(student.values)
print()
print(student.index)
print()
print(student.shape)   # bir tuples döndürüyor. 3 elemanlı tek boyutlu.
print()
print(student.ndim)
print()
print(student.size)
print()
print(student.name)
print()
print(student.dtype)

name          Arin
age             23
department      CE
dtype: object
<class 'pandas.core.series.Series'>
['Arin' 23 'CE']

Index(['name', 'age', 'department'], dtype='object')

(3,)

1

3

None

object

In [14]:
student.name = "Maradona"
print(student.name)

Maradona

In [15]:
"Arin" in student.values

True

In [16]:
numbers = pd.Series([4,2.5,2])
print(numbers)
print(numbers.sum())
print(numbers.mean())
print(numbers.product())

0    4.0
1    2.5
2    2.0
dtype: float64
8.5
2.8333333333333335
20.0

In [17]:
import pandas as pd

In [18]:
student = pd.Series(data=["Arin","Software",23,"CE"], index=["name","surname","age","department"])
print(student)

name              Arin
surname       Software
age                 23
department          CE
dtype: object

In [19]:
# data ve index yazmasak bile default olarak ilkini data sonrasını ise index olarak alıyor.
student = pd.Series(["Arin","Software",23,"CE"],["name","surname","age","department"])
print(student)

name              Arin
surname       Software
age                 23
department          CE
dtype: object

In [20]:
print(student["name"])

Arin

In [21]:
print(student["name","age"])

KeyError: 'key of type tuple not found and not a MultiIndex'

In [22]:
# yukarıdaki hatayı engellemek yani 1 den fazla değişken var ise iç içe iki liste olarak yazdırmalıyız.
print(student[["name","age"]])
print(type(student[["name","age"]]))

name    Arin
age       23
dtype: object
<class 'pandas.core.series.Series'>

In [23]:
print(student[1])  # index numarası olarak bunu vermemize rağmen çağırdığımızda geliyor.

Software

In [24]:
print(student[[0,1]])

name           Arin
surname    Software
dtype: object

In [25]:
print(student[0:3])

name           Arin
surname    Software
age              23
dtype: object

In [26]:
print(student[0:])

name              Arin
surname       Software
age                 23
department          CE
dtype: object

In [27]:
print(student[-2:])

age           23
department    CE
dtype: object

In [28]:
print(student["name":"age"])  # bu şekilde çağırınca son değişkeni dahil ediyor.

name           Arin
surname    Software
age              23
dtype: object

In [29]:
# loc -> location ,  iloc-> index location

In [30]:
print(student.loc["department"])

CE

In [31]:
print(student.iloc[1])

Software

In [32]:
print(student.iloc["department"])  # index numarası ile çalışıyor.

TypeError: Cannot index by location index with a non-integer key

In [33]:
print(student)
print()
student["name"]="Elis"
print(student)
student.iloc[2] = 15
print()
print(student)

name              Arin
surname       Software
age                 23
department          CE
dtype: object

name              Elis
surname       Software
age                 23
department          CE
dtype: object

name              Elis
surname       Software
age                 15
department          CE
dtype: object

In [34]:
print(student)
print()
student.drop("name")   # drop bu şekilde kullanılınca orjinal seride değişiklik yapmazb
print(student)

name              Elis
surname       Software
age                 15
department          CE
dtype: object

name              Elis
surname       Software
age                 15
department          CE
dtype: object

In [35]:
print(student)
print()
student2 = student.drop("name")   # sadece yapılan değişikliği görsel olarak görebiliriz.
print(student2)
print()
print(student)

name              Elis
surname       Software
age                 15
department          CE
dtype: object

surname       Software
age                 15
department          CE
dtype: object

name              Elis
surname       Software
age                 15
department          CE
dtype: object

In [36]:
print(student)
print()
student.drop("name",inplace=True)  # bununla kalıcı olarak silebiliriz.
print(student)

name              Elis
surname       Software
age                 15
department          CE
dtype: object

surname       Software
age                 15
department          CE
dtype: object

In [37]:
student = pd.Series(["Arin","Softwaret",23,"CE"],["name","surname","age","department"])
print(student)
print()
print(len(student))
print(list(student))
print(dict(student))
print(max(student))  # int ve str tipleri olduğundan bunları sıralayamıyor.
print(sorted(student))   # int ve str tipleri olduğundan bunları sıralayamıyor.

name               Arin
surname       Softwaret
age                  23
department           CE
dtype: object

4
['Arin', 'Softwaret', 23, 'CE']
{'name': 'Arin', 'surname': 'Softwaret', 'age': 23, 'department': 'CE'}

TypeError: '>' not supported between instances of 'int' and 'str'

In [38]:
student = pd.Series(["Arin","Software","CE"],["name","surname","department"])
print(max(student))
print(sorted(student))

Software
['Arin', 'CE', 'Software']

In [39]:
import pandas as pd

In [40]:
pwd

'C:\\Users\\HP\\DATA_SCIENCE_COURSE_NOTES\\DAwPython\\Pandas_Notes'

In [41]:
data = pd.read_csv("C:\\Users\\HP\\DATA_SCIENCE_COURSE_NOTES\\Datalar\\data.csv", sep=",") # encoding="utf-8", engine="python" gibi alacağımız hataya göre ek parametler yazabiliriz.
data

# data veri tipine baktığımızda sonuc DataFrame olur. Seriye dönmek için önce argüman olarak squeeze=True olarak yazarız sonra da sadece çalışmak istediğimiz sütunu usecols=["StockCode"] yazarak sadece bir sütuna ait birseri seçmiş oluruz.

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [42]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [43]:
data1 = pd.read_csv("C:\\Users\\HP\\DATA_SCIENCE_COURSE_NOTES\\Datalar\\data.csv", sep=",", usecols=["StockCode"], squeeze=True) # encoding="utf-8", engine="python" gibi alacağımız hataya göre ek parametler yazabiliriz.
data1

0         85123A
1          71053
2         84406B
3         84029G
4         84029E
           ...
541904     22613
541905     22899
541906     23254
541907     23255
541908     22138
Name: StockCode, Length: 541909, dtype: object

In [44]:
print(type(data1))  # görüldügü gibi bir sütun çağırınca veri tipi seri geldi.

<class 'pandas.core.series.Series'>

In [45]:
print(data1.head(5))

0    85123A
1     71053
2    84406B
3    84029G
4    84029E
Name: StockCode, dtype: object

In [46]:
print(data1.tail(5))

541904    22613
541905    22899
541906    23254
541907    23255
541908    22138
Name: StockCode, dtype: object

In [47]:
print(data1.sort_values().head(10))  # kalıcı olmasını istiyorsak inplace=True olarak yazarız.

160128    10002
6166      10002
75792     10002
63082     10002
76571     10002
106195    10002
61929     10002
77513     10002
44809     10002
23896     10002
Name: StockCode, dtype: object

In [48]:
print(data1.sort_values(ascending=False).head(10))

40383                m
178556    gift_0001_50
245516    gift_0001_50
239744    gift_0001_50
42057     gift_0001_50
281008    gift_0001_40
38248     gift_0001_40
145463    gift_0001_40
322164    gift_0001_30
208808    gift_0001_30
Name: StockCode, dtype: object

In [49]:
data1.sort_index(ascending=False).head(10)

541908    22138
541907    23255
541906    23254
541905    22899
541904    22613
541903    23256
541902    22629
541901    22367
541900    22730
541899    22726
Name: StockCode, dtype: object

In [50]:
data1.get(100)

'84519A'

In [51]:
print(type(data1.get(100004)))

<class 'str'>

In [52]:
import pandas as pd

In [53]:
students = [{ "name": "arya",
              "age": 21,
              "gender":"F"},
            
            {"name": "Karya",
              "age": 12,
              "gender":"M"},
            
            {"name": "Alex",
              "age": 33,
              "gender":"M"}
            ]

In [54]:
print(students)

[{'name': 'arya', 'age': 21, 'gender': 'F'}, {'name': 'Karya', 'age': 12, 'gender': 'M'}, {'name': 'Alex', 'age': 33, 'gender': 'M'}]

In [55]:
print(type(students))

<class 'list'>

In [56]:
pd.DataFrame(students)

    name  age gender
0   arya   21      F
1  Karya   12      M
2   Alex   33      M

In [57]:
print(type(pd.DataFrame(students)))

<class 'pandas.core.frame.DataFrame'>

In [58]:
teachers = { "names": ["ahmet","mehmet","Arzu"],
              "age": [43, 35, 22],
              "gender": ["M", "M", "F"]}
            
teachers

{'names': ['ahmet', 'mehmet', 'Arzu'],
 'age': [43, 35, 22],
 'gender': ['M', 'M', 'F']}

In [59]:
pd.DataFrame(teachers)

    names  age gender
0   ahmet   43      M
1  mehmet   35      M
2    Arzu   22      F

In [60]:
print(type(pd.DataFrame(teachers)))

<class 'pandas.core.frame.DataFrame'>

In [61]:
list_of_list = [["ahmet","veli","ceylan"],
                [22,18,45]]
list_of_list

[['ahmet', 'veli', 'ceylan'], [22, 18, 45]]

In [62]:
pd.DataFrame(list_of_list)

       0     1       2
0  ahmet  veli  ceylan
1     22    18      45

In [63]:
print(type(pd.DataFrame(list_of_list)))

<class 'pandas.core.frame.DataFrame'>

In [64]:
names = ["ahmet","mahmut","fatih"]
names

['ahmet', 'mahmut', 'fatih']

In [65]:
print(type(names))

<class 'list'>

In [66]:
pd.DataFrame(names)

        0
0   ahmet
1  mahmut
2   fatih

In [67]:
print(pd.DataFrame(names))

        0
0   ahmet
1  mahmut
2   fatih

In [68]:
print(pd.DataFrame(names).ndim)

2

In [69]:
teacher = {"name": "jale","age": 24}
teacher

{'name': 'jale', 'age': 24}

In [70]:
pd.DataFrame(teacher)

ValueError: If using all scalar values, you must pass an index

In [71]:
student =  {"Hale": pd.Series(data=[25,"F","CE"], index=["age","gender","department"]),
            "Ahmet": pd.Series(data=[37,"M","CE"], index=["age","gender","department"])}
student

{'Hale': age           25
 gender         F
 department    CE
 dtype: object,
 'Ahmet': age           37
 gender         M
 department    CE
 dtype: object}

In [72]:
pd.DataFrame(student)

           Hale Ahmet
age          25    37
gender        F     M
department   CE    CE

In [73]:
student =  {"Hale": pd.Series(data=[25,"F","CE",178], index=["age","gender","department","height"]),
            "Ahmet": pd.Series(data=[37,"M","CE",45], index=["age","gender","department","weight"])}
student

{'Hale': age            25
 gender          F
 department     CE
 height        178
 dtype: object,
 'Ahmet': age           37
 gender         M
 department    CE
 weight        45
 dtype: object}

In [74]:
pd.DataFrame(student)

           Hale Ahmet
age          25    37
department   CE    CE
gender        F     M
height      178   NaN
weight      NaN    45

In [75]:
students = [{ "name": "arya",
              "age": 21,
              "gender":"F"},
            
            {"name": "Karya",
              "age": 12,
              "gender":"M"},
            
            {"name": "Alex",
              "age": 33,
              "gender":"M"}
            ]
students

[{'name': 'arya', 'age': 21, 'gender': 'F'},
 {'name': 'Karya', 'age': 12, 'gender': 'M'},
 {'name': 'Alex', 'age': 33, 'gender': 'M'}]

In [76]:
pd.DataFrame(students)

    name  age gender
0   arya   21      F
1  Karya   12      M
2   Alex   33      M

In [77]:
teacherss = { "names": ["ahmet","mehmet","cansu"],
              "age" :[38, 45, 25],
              "gender":["M","M","F"]}
teacherss

{'names': ['ahmet', 'mehmet', 'cansu'],
 'age': [38, 45, 25],
 'gender': ['M', 'M', 'F']}

In [78]:
pd.DataFrame(teacherss)

    names  age gender
0   ahmet   38      M
1  mehmet   45      M
2   cansu   25      F

In [79]:
list = [["ahmet","mehmet","canan"],
       [45,27,25]]
list

[['ahmet', 'mehmet', 'canan'], [45, 27, 25]]

In [80]:
pd.DataFrame(list)

       0       1      2
0  ahmet  mehmet  canan
1     45      27     25

In [81]:
names = ["kerim","kenan","karian"]
names

['kerim', 'kenan', 'karian']

In [82]:
pd.DataFrame(names)

        0
0   kerim
1   kenan
2  karian

In [83]:
alias = {"name":"hale", "age": 26}
alias

{'name': 'hale', 'age': 26}

In [84]:
pd.DataFrame(alias)

ValueError: If using all scalar values, you must pass an index

In [112]:
student =  {"Hale": pd.Series(data=[25,"F","CE",168], index=["age","gender","department","height"]),
            "Ahmet": pd.Series(data=[37,"M","CE",185], index=["age","gender","department","height"]),
            "Mert": pd.Series(data=[57,"M","CE",165], index=["age","gender","department","height"])}
student

{'Hale': age            25
 gender          F
 department     CE
 height        168
 dtype: object,
 'Ahmet': age            37
 gender          M
 department     CE
 height        185
 dtype: object,
 'Mert': age            57
 gender          M
 department     CE
 height        165
 dtype: object}

In [113]:
student = pd.DataFrame(student)
student

           Hale Ahmet Mert
age          25    37   57
gender        F     M    M
department   CE    CE   CE
height      168   185  165

In [114]:
pd.DataFrame(student, columns=["Hale","Ahmet"])

           Hale Ahmet
age          25    37
gender        F     M
department   CE    CE
height      168   185

In [115]:
pd.DataFrame(student, index=["gender"])

       Hale Ahmet Mert
gender    F     M    M

In [116]:
pd.DataFrame(student, columns=["Hale","Ahmet"], index=["age","gender"])

       Hale Ahmet
age      25    37
gender    F     M

In [117]:
student["Ahmet"]

age            37
gender          M
department     CE
height        185
Name: Ahmet, dtype: object

In [118]:
print(type(student["Ahmet"]))

<class 'pandas.core.series.Series'>

In [119]:
student[["Ahmet"]]

           Ahmet
age           37
gender         M
department    CE
height       185

In [120]:
print(type(student[["Ahmet"]]))

<class 'pandas.core.frame.DataFrame'>

In [121]:
student[["Ahmet","Hale"]]

           Ahmet Hale
age           37   25
gender         M    F
department    CE   CE
height       185  168

In [122]:
student.loc["age"]

Hale     25
Ahmet    37
Mert     57
Name: age, dtype: object

In [123]:
student.loc[["age"]]

    Hale Ahmet Mert
age   25    37   57

In [124]:
student.iloc[[0]]

    Hale Ahmet Mert
age   25    37   57

In [125]:
student["Hale"]["gender"]   #df[col][row]

'F'

In [126]:
student["Hale"][0]

25

In [127]:
student[0]["age"]

KeyError: 0

In [128]:
student.iloc[0][1]

37

In [129]:
student["Fatih"] = [17,"M","ELH",195]
student

           Hale Ahmet Mert Fatih
age          25    37   57    17
gender        F     M    M     M
department   CE    CE   CE   ELH
height      168   185  165   195

In [130]:
student["Halil"] = student["Fatih"] + student["Hale"]
student

           Hale Ahmet Mert Fatih  Halil
age          25    37   57    17     42
gender        F     M    M     M     MF
department   CE    CE   CE   ELH  ELHCE
height      168   185  165   195    363

In [131]:
new_row = pd.DataFrame({"Hale":"kurek", "Ahmet":"manav","Mert":"CAN","Fatih":"Keriz","Halil":"Bekle"}, index=["surname"])

In [132]:
student = student.append(new_row)
student

             Hale  Ahmet Mert  Fatih  Halil
age            25     37   57     17     42
gender          F      M    M      M     MF
department     CE     CE   CE    ELH  ELHCE
height        168    185  165    195    363
surname     kurek  manav  CAN  Keriz  Bekle

In [106]:
# pop--> columns
# drop--> columns and rows(axis)

In [133]:
student.pop("Ahmet")   # kalıcı işlem yapıyor.

age              37
gender            M
department       CE
height          185
surname       manav
Name: Ahmet, dtype: object

In [134]:
student.drop("Hale", axis=1)  # kalıcı işlem yapmıyor. Kalıcı olması için inplace=True kullanılmalı.
# birden fazla sütundan kurtulmak için list şeklinde yazmalıyız.

           Mert  Fatih  Halil
age          57     17     42
gender        M      M     MF
department   CE    ELH  ELHCE
height      165    195    363
surname     CAN  Keriz  Bekle

In [135]:
student

             Hale Mert  Fatih  Halil
age            25   57     17     42
gender          F    M      M     MF
department     CE   CE    ELH  ELHCE
height        168  165    195    363
surname     kurek  CAN  Keriz  Bekle

In [136]:
student.drop("gender", axis=0)

             Hale Mert  Fatih  Halil
age            25   57     17     42
department     CE   CE    ELH  ELHCE
height        168  165    195    363
surname     kurek  CAN  Keriz  Bekle

In [137]:
student

             Hale Mert  Fatih  Halil
age            25   57     17     42
gender          F    M      M     MF
department     CE   CE    ELH  ELHCE
height        168  165    195    363
surname     kurek  CAN  Keriz  Bekle

In [151]:
student =  {"Hale": pd.Series(data=[25,"cetin","CE",168], index=["age","surname","department","height"]),
            "Ahmet": pd.Series(data=[37,"M","CE"], index=["age","gender","department"]),
            "Mert": pd.Series(data=[57,"M","CE",165], index=["age","gender","department","height"])}

In [155]:
student = pd.DataFrame(student)
student

             Hale Ahmet Mert
age            25    37   57
department     CE    CE   CE
gender        NaN     M    M
height        168   NaN  165
surname     cetin   NaN  NaN

In [157]:
student.isnull()  # value nin olup olmamasına göre True/False dönüyor. Yoksa True dönüyor.

             Hale  Ahmet   Mert
age         False  False  False
department  False  False  False
gender       True  False  False
height      False   True  False
surname     False   True   True

In [158]:
student.isnull().sum()  # her bir sütundakı null değerlerin toplamını veriyor.

Hale     1
Ahmet    2
Mert     1
dtype: int64

In [159]:
student.isnull().sum().sum()  # veri setindeki toplam null değeri sayısını bulduk.

4

In [160]:
student.notnull()

             Hale  Ahmet   Mert
age          True   True   True
department   True   True   True
gender      False   True   True
height       True  False   True
surname      True  False  False

In [161]:
student.notnull().sum()

Hale     4
Ahmet    3
Mert     4
dtype: int64

In [162]:
student.notnull().sum().sum()

11

In [163]:
student.count()

Hale     4
Ahmet    3
Mert     4
dtype: int64

In [164]:
stu_new = student.dropna()  # içinde NaN olan değerleri sildi.
stu_new

           Hale Ahmet Mert
age          25    37   57
department   CE    CE   CE

In [165]:
stu_new = student.dropna(how="all")  # içinde NaN olan değerleri sildi.
stu_new

             Hale Ahmet Mert
age            25    37   57
department     CE    CE   CE
gender        NaN     M    M
height        168   NaN  165
surname     cetin   NaN  NaN

In [166]:
stu_new = student.dropna(how="any")  # içinde NaN olan değerleri sildi.
stu_new

           Hale Ahmet Mert
age          25    37   57
department   CE    CE   CE

In [167]:
student["Ahmet"]["age"] = None
student

             Hale Ahmet Mert
age            25  None   57
department     CE    CE   CE
gender        NaN     M    M
height        168   NaN  165
surname     cetin   NaN  NaN

In [168]:
stu_new = student.dropna(how="any")  # içinde NaN olan değerleri sildi.
stu_new

           Hale Ahmet Mert
department   CE    CE   CE

In [169]:
stu_new = student.dropna(thresh=1)  # içinde NaN olan değerleri sildi.
stu_new

             Hale Ahmet Mert
age            25  None   57
department     CE    CE   CE
gender        NaN     M    M
height        168   NaN  165
surname     cetin   NaN  NaN

In [170]:
stu_new = student.dropna(thresh=2)  # içinde NaN olan değerleri sildi.
stu_new

           Hale Ahmet Mert
age          25  None   57
department   CE    CE   CE
gender      NaN     M    M
height      168   NaN  165

In [205]:
import numpy as np
df1 = pd.DataFrame(np.arange(30).reshape(5,6))
df1.iloc[2:4,2:3] = np.nan
df1.iloc[:4,1] = np.nan
df1.iloc[4,5] = np.nan
df1

    0     1     2   3   4     5
0   0   NaN   2.0   3   4   5.0
1   6   NaN   8.0   9  10  11.0
2  12   NaN   NaN  15  16  17.0
3  18   NaN   NaN  21  22  23.0
4  24  25.0  26.0  27  28   NaN

In [199]:
df1.dropna(thresh=1)

    0     1     2   3   4     5
0   0   NaN   2.0   3   4   5.0
1   6   NaN   8.0   9  10  11.0
2  12   NaN   NaN  15  16  17.0
3  18   NaN   NaN  21  22  23.0
4  24  25.0  26.0  27  28   NaN

In [200]:
df1.dropna(thresh=2, axis=1)

    0     2   3   4     5
0   0   2.0   3   4   5.0
1   6   8.0   9  10  11.0
2  12   NaN  15  16  17.0
3  18   NaN  21  22  23.0
4  24  26.0  27  28   NaN

In [201]:
df1.dropna(thresh=3, axis=1)

    0     2   3   4     5
0   0   2.0   3   4   5.0
1   6   8.0   9  10  11.0
2  12   NaN  15  16  17.0
3  18   NaN  21  22  23.0
4  24  26.0  27  28   NaN

In [206]:
df1.dropna(thresh=4, axis=1)

    0   3   4     5
0   0   3   4   5.0
1   6   9  10  11.0
2  12  15  16  17.0
3  18  21  22  23.0
4  24  27  28   NaN

In [208]:
df = pd.DataFrame({'movie': ['thg', 'thg', 'mol', 'mol', 'lob', 'lob'],
                  'rating': [3., 4., 5., np.nan, np.nan, np.nan],
                  'name': ['John', np.nan, 'N/A', 'Graham', np.nan, np.nan]})

df

  movie  rating    name
0   thg     3.0    John
1   thg     4.0     NaN
2   mol     5.0     N/A
3   mol     NaN  Graham
4   lob     NaN     NaN
5   lob     NaN     NaN

In [210]:
df.dropna(thresh=1)

  movie  rating    name
0   thg     3.0    John
1   thg     4.0     NaN
2   mol     5.0     N/A
3   mol     NaN  Graham
4   lob     NaN     NaN
5   lob     NaN     NaN

In [211]:
df.dropna(thresh=2)

  movie  rating    name
0   thg     3.0    John
1   thg     4.0     NaN
2   mol     5.0     N/A
3   mol     NaN  Graham

In [213]:
df.dropna(thresh=3, axis=1)

  movie  rating    name
0   thg     3.0    John
1   thg     4.0     NaN
2   mol     5.0     N/A
3   mol     NaN  Graham
4   lob     NaN     NaN
5   lob     NaN     NaN

In [216]:
student

             Hale Ahmet Mert
age            25  None   57
department     CE    CE   CE
gender        NaN     M    M
height        168   NaN  165
surname     cetin   NaN  NaN

In [215]:
y = student.fillna(method="ffill", axis=0) 
y

             Hale Ahmet Mert
age            25  None   57
department     CE    CE   CE
gender         CE     M    M
height        168     M  165
surname     cetin     M  165

In [217]:
y = student.fillna(method="ffill", axis=1) 
y

             Hale  Ahmet   Mert
age            25     25     57
department     CE     CE     CE
gender        NaN      M      M
height        168    168    165
surname     cetin  cetin  cetin

In [3]:
import pandas as pd
import numpy as np
data = pd.read_csv("C:\\Users\\HP\\DATA_SCIENCE_COURSE_NOTES\\Datalar\\data.csv", sep=",") # encoding="utf-8", engine="python" gibi alacağımız hataya göre ek parametler yazabiliriz.
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [5]:
data.ndim

2

In [6]:
data.shape

(541909, 8)

In [7]:
data.size

4335272

In [8]:
data.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [9]:
data.memory_usage()

Index              128
InvoiceNo      4335272
StockCode      4335272
Description    4335272
Quantity       4335272
InvoiceDate    4335272
UnitPrice      4335272
CustomerID     4335272
Country        4335272
dtype: int64

In [10]:
data.Quantity.sum()

5176450

In [11]:
data.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [13]:
data["Country"].value_counts()  # değerlerin kaç kere kullanıldığını gösterir.

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [14]:
data["Description"].value_counts()

WHITE HANGING HEART T-LIGHT HOLDER     2369
REGENCY CAKESTAND 3 TIER               2200
JUMBO BAG RED RETROSPOT                2159
PARTY BUNTING                          1727
LUNCH BAG RED RETROSPOT                1638
                                       ...
FILIGREE DIAMANTE CHAIN                   1
NECKLACE+BRACELET SET PINK DAISY          1
HEAVENS SCENT FRAGRANCE OILS ASSTD        1
*Boombox Ipod Classic                     1
Dotcomgiftshop Gift Voucher �100.00       1
Name: Description, Length: 4223, dtype: int64

In [15]:
data["CustomerID"].value_counts()

17841.0    7983
14911.0    5903
14096.0    5128
12748.0    4642
14606.0    2782
           ...
14351.0       1
13256.0       1
12943.0       1
17923.0       1
13747.0       1
Name: CustomerID, Length: 4372, dtype: int64

In [18]:
data["UnitPrice"].sort_values(ascending=False)

222681    38970.00
524602    17836.46
43702     16888.02
43703     16453.71
15017     13541.33
            ...
128465        0.00
128464        0.00
40089         0.00
299984   -11062.06
299983   -11062.06
Name: UnitPrice, Length: 541909, dtype: float64

In [21]:
data["Country"].sort_values().value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [23]:
data["Country"].value_counts().sort_values(ascending=False)

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [24]:
data["Country"]=="Germany"

0         False
1         False
2         False
3         False
4         False
          ...
541904    False
541905    False
541906    False
541907    False
541908    False
Name: Country, Length: 541909, dtype: bool

In [33]:
data[data["Country"]!="Germany"]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [35]:
data[(data["UnitPrice"]>data["UnitPrice"].mean())&(data["Country"]=="Germany")]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
1118,536527,22837,HOT WATER BOTTLE BABUSHKA,4,12/1/2010 13:04,4.65,12662.0,Germany
1123,536527,POST,POSTAGE,1,12/1/2010 13:04,18.00,12662.0,Germany
1977,C536548,22654,DELUXE SEWING KIT,-1,12/1/2010 14:33,5.95,12472.0,Germany
1978,C536548,22767,TRIPLE PHOTO FRAME CORNICE,-2,12/1/2010 14:33,9.95,12472.0,Germany
1983,C536548,22168,ORGANISER WOOD ANTIQUE WHITE,-2,12/1/2010 14:33,8.50,12472.0,Germany
...,...,...,...,...,...,...,...,...
541763,581574,23111,PARISIENNE SEWING BOX,2,12/9/2011 12:09,12.50,12526.0,Germany
541767,581574,POST,POSTAGE,2,12/9/2011 12:09,18.00,12526.0,Germany
541768,581578,POST,POSTAGE,3,12/9/2011 12:16,18.00,12713.0,Germany
541786,581578,22622,BOX OF VINTAGE ALPHABET BLOCKS,6,12/9/2011 12:16,11.95,12713.0,Germany
541800,581578,23298,SPOTTY BUNTING,9,12/9/2011 12:16,4.95,12713.0,Germany

In [41]:
mask1 = data["Quantity"]>20
mask2 = data["UnitPrice"]>18.0
mask = mask1|mask2
data[mask].head(100)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,12/1/2010 8:45,3.75,12583.0,France
27,536370,22727,ALARM CLOCK BAKELIKE RED,24,12/1/2010 8:45,3.75,12583.0,France
30,536370,21883,STARS GIFT TAPE,24,12/1/2010 8:45,0.65,12583.0,France
31,536370,10002,INFLATABLE POLITICAL GLOBE,48,12/1/2010 8:45,0.85,12583.0,France
...,...,...,...,...,...,...,...,...
415,536405,20914,SET/5 RED RETROSPOT LID GLASS BOWLS,128,12/1/2010 11:32,2.55,14045.0,United Kingdom
431,536406,22803,IVORY EMBROIDERED QUILT,2,12/1/2010 11:33,35.75,17850.0,United Kingdom
435,536408,22537,MAGIC DRAWING SLATE DINOSAUR,24,12/1/2010 11:41,0.42,14307.0,United Kingdom
436,536408,22533,MAGIC DRAWING SLATE BAKE A CAKE,24,12/1/2010 11:41,0.42,14307.0,United Kingdom
448,536408,22418,10 COLOUR SPACEBOY PEN,24,12/1/2010 11:41,0.85,14307.0,United Kingdom

In [47]:
mask = (data["Country"]=="Germany") | (data["Country"]=="France") | (data["Country"]=="United Kingdom")
data[mask]["Country"].value_counts()

United Kingdom    495478
Germany             9495
France              8557
Name: Country, dtype: int64

In [49]:
mask = data["Country"].isin(["Germany",	"France", "United Kingdom"])
data[mask]["Country"].value_counts()

United Kingdom    495478
Germany             9495
France              8557
Name: Country, dtype: int64

In [50]:
mask = data["UnitPrice"].between(10,500)  # bu değerler inclusive
data[mask]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
45,536370,POST,POSTAGE,3,12/1/2010 8:45,18.00,12583.0,France
65,536374,21258,VICTORIAN SEWING BOX LARGE,32,12/1/2010 9:09,10.95,15100.0,United Kingdom
141,C536379,D,Discount,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom
151,536382,22839,3 TIER CAKE TIN GREEN AND CREAM,2,12/1/2010 9:45,14.95,16098.0,United Kingdom
152,536382,22838,3 TIER CAKE TIN RED AND CREAM,2,12/1/2010 9:45,14.95,16098.0,United Kingdom
...,...,...,...,...,...,...,...,...
541762,581574,21258,VICTORIAN SEWING BOX LARGE,2,12/9/2011 12:09,12.75,12526.0,Germany
541763,581574,23111,PARISIENNE SEWING BOX,2,12/9/2011 12:09,12.50,12526.0,Germany
541767,581574,POST,POSTAGE,2,12/9/2011 12:09,18.00,12526.0,Germany
541768,581578,POST,POSTAGE,3,12/9/2011 12:16,18.00,12713.0,Germany
541786,581578,22622,BOX OF VINTAGE ALPHABET BLOCKS,6,12/9/2011 12:16,11.95,12713.0,Germany

In [51]:
mask = data["InvoiceDate"].between("12/1/2010","12/9/2011")  # bu değerler inclusive
data[mask]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
540272,581474,21253,SET OF PICTURE FRAME STICKERS,1,12/8/2011 20:01,0.79,12748.0,United Kingdom
540273,581474,22108,PING! MICROWAVE PLATE,1,12/8/2011 20:01,1.25,12748.0,United Kingdom
540274,581474,22167,OVAL WALL MIRROR DIAMANTE,1,12/8/2011 20:01,9.95,12748.0,United Kingdom
540275,581474,21929,JUMBO BAG PINK VINTAGE PAISLEY,1,12/8/2011 20:01,2.08,12748.0,United Kingdom
540276,581474,20717,STRAWBERRY SHOPPER BAG,1,12/8/2011 20:01,1.25,12748.0,United Kingdom

In [54]:
data.sort_values("Country")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
344571,567085,23328,SET 6 SCHOOL MILK BOTTLES IN CRATE,12,9/16/2011 12:38,3.75,12434.0,Australia
270069,C560540,23240,SET OF 4 KNICK KNACK TINS DOILEY,-1,7/19/2011 12:26,4.15,12415.0,Australia
270070,C560540,23237,SET OF 4 KNICK KNACK TINS LEAF,-1,7/19/2011 12:26,4.15,12415.0,Australia
270071,C560540,23236,DOILEY STORAGE TIN,-1,7/19/2011 12:26,2.89,12415.0,Australia
270072,C560540,23235,STORAGE TIN VINTAGE LEAF,-1,7/19/2011 12:26,2.89,12415.0,Australia
...,...,...,...,...,...,...,...,...
282768,561658,84559B,3D SHEET OF CAT STICKERS,1,7/28/2011 16:06,0.85,12743.0,Unspecified
282769,561658,84549,CROCHET WHITE RABBIT KEYRING,1,7/28/2011 16:06,1.65,12743.0,Unspecified
282770,561658,22840,ROUND CAKE TIN VINTAGE RED,1,7/28/2011 16:06,7.95,12743.0,Unspecified
282756,561658,22752,SET 7 BABUSHKA NESTING BOXES,1,7/28/2011 16:06,8.50,12743.0,Unspecified
282775,561658,47559B,TEA TIME OVEN GLOVE,1,7/28/2011 16:06,1.25,12743.0,Unspecified

In [55]:
data["Country"].duplicated()

0         False
1          True
2          True
3          True
4          True
          ...
541904     True
541905     True
541906     True
541907     True
541908     True
Name: Country, Length: 541909, dtype: bool

In [56]:
mask = ~data["Country"].duplicated()
data[mask]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,12/1/2010 8:45,3.75,12583.0,France
197,536389,22941,CHRISTMAS LIGHTS 10 REINDEER,6,12/1/2010 10:03,8.50,12431.0,Australia
385,536403,22867,HAND WARMER BIRD DESIGN,96,12/1/2010 11:27,1.85,12791.0,Netherlands
1109,536527,22809,SET OF 6 T-LIGHTS SANTA,6,12/1/2010 13:04,2.95,12662.0,Germany
1236,536532,84692,BOX OF 24 COCKTAIL PARASOLS,50,12/1/2010 13:24,0.42,12433.0,Norway
1404,536540,22968,ROSE COTTAGE KEEPSAKE BOX,4,12/1/2010 14:05,9.95,14911.0,EIRE
5320,536858,22326,ROUND SNACK BOXES SET OF4 WOODLAND,30,12/3/2010 10:36,2.95,13520.0,Switzerland
6421,536944,22383,LUNCH BAG SUKI DESIGN,70,12/3/2010 12:20,1.65,12557.0,Spain
6608,536971,21733,RED HANGING HEART T-LIGHT HOLDER,32,12/3/2010 13:40,2.55,12779.0,Poland
7134,536990,21992,VINTAGE PAISLEY STATIONERY SET,6,12/3/2010 15:14,2.95,12793.0,Portugal
7214,537022,22791,T-LIGHT GLASS FLUTED ANTIQUE,12,12/3/2010 15:45,1.25,12725.0,Italy
7279,537026,84375,SET OF 20 KIDS COOKIE CUTTERS,12,12/3/2010 16:35,2.10,12395.0,Belgium
7986,537081,22409,MONEY BOX BISCUITS DESIGN,12,12/5/2010 12:00,1.25,15332.0,Lithuania
9783,537218,85016,SET OF 6 VINTAGE NOTELETS KIT,6,12/5/2010 15:46,2.55,12763.0,Japan
14938,537626,85116,BLACK CANDELABRA T-LIGHT HOLDER,12,12/7/2010 14:57,2.10,12347.0,Iceland
20000,538002,22690,DOORMAT HOME SWEET HOME BLUE,2,12/9/2010 11:48,7.95,14932.0,Channel Islands
20017,538003,22847,BREAD BIN DINER STYLE IVORY,8,12/9/2010 12:05,14.95,12429.0,Denmark
29732,538826,85123A,WHITE HANGING HEART T-LIGHT HOLDER,64,12/14/2010 12:58,2.55,12370.0,Cyprus
30078,C538847,85232B,SET OF 3 BABUSHKA STACKING TINS,-240,12/14/2010 13:27,4.95,17404.0,Sweden
31464,C538971,22153,ANGEL DECORATION STARS ON DRESS,-48,12/15/2010 11:39,0.42,12865.0,Austria
31982,C539037,84792,ENCHANTED BIRD COATHANGER 5 HOOK,-24,12/15/2010 14:42,3.81,12666.0,Israel
34083,539318,84992,72 SWEETHEART FAIRY CAKE CASES,72,12/16/2010 19:09,0.55,12348.0,Finland
38313,539500,72802B,OCEAN SCENT CANDLE IN JEWELLED BOX,54,12/20/2010 11:02,3.81,NaN,Bahrain
69007,541932,22699,ROSES REGENCY TEACUP AND SAUCER,24,1/24/2011 11:39,2.55,14439.0,Greece
69623,541975,22620,4 TRADITIONAL SPINNING TOPS,60,1/24/2011 14:24,1.25,NaN,Hong Kong
70758,542102,21519,GIN & TONIC DIET GREETING CARD,72,1/25/2011 13:26,0.36,12744.0,Singapore
72985,542276,82551,LAUNDRY 15C METAL SIGN,12,1/27/2011 10:19,1.45,12764.0,Lebanon
89570,543911,21485,RETROSPOT HEART HOT WATER BOTTLE,6,2/14/2011 12:46,4.95,17829.0,United Arab Emirates
100810,544838,22915,ASSORTED BOTTLE TOP MAGNETS,12,2/24/2011 10:34,0.42,12565.0,Saudi Arabia
103598,545072,22930,BAKING MOULD HEART MILK CHOCOLATE,18,2/28/2011 8:43,2.55,12781.0,Czech Republic
119191,546533,20886,BOX OF 9 PEBBLE CANDLES,12,3/14/2011 13:53,1.95,15388.0,Canada
152712,549687,20685,DOORMAT RED RETROSPOT,2,4/11/2011 13:29,7.95,12363.0,Unspecified
157299,550201,22423,REGENCY CAKESTAND 3 TIER,16,4/15/2011 10:25,10.95,12769.0,Brazil
164464,550644,22722,SET OF 6 SPICE TINS PANTRY DESIGN,7,4/19/2011 16:19,3.95,12733.0,USA
168149,551013,22839,3 TIER CAKE TIN GREEN AND CREAM,1,4/26/2011 10:54,14.95,15108.0,European Community
217684,555931,22784,LANTERN CREAM GAZEBO,3,6/8/2011 8:31,4.95,17828.0,Malta
395472,571035,21238,RED RETROSPOT CUP,8,10/13/2011 12:50,0.85,12446.0,RSA

In [61]:
len(data[mask])

38

In [57]:
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [58]:
len(data)

541909

In [59]:
len(data.drop_duplicates())

536641

In [60]:
len(data.drop_duplicates(subset=["Country"]))

38

In [62]:
data["Country"]

0         United Kingdom
1         United Kingdom
2         United Kingdom
3         United Kingdom
4         United Kingdom
               ...
541904            France
541905            France
541906            France
541907            France
541908            France
Name: Country, Length: 541909, dtype: object

In [63]:
data["Country"].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

In [64]:
len(data["Country"].unique())

38

In [65]:
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [67]:
type(data["Country"])

pandas.core.series.Series

In [68]:
print(data["Country"].str.upper())
print(data["Country"].str.lower())
print(data["Country"].str.title())

0         UNITED KINGDOM
1         UNITED KINGDOM
2         UNITED KINGDOM
3         UNITED KINGDOM
4         UNITED KINGDOM
               ...
541904            FRANCE
541905            FRANCE
541906            FRANCE
541907            FRANCE
541908            FRANCE
Name: Country, Length: 541909, dtype: object
0         united kingdom
1         united kingdom
2         united kingdom
3         united kingdom
4         united kingdom
               ...
541904            france
541905            france
541906            france
541907            france
541908            france
Name: Country, Length: 541909, dtype: object
0         United Kingdom
1         United Kingdom
2         United Kingdom
3         United Kingdom
4         United Kingdom
               ...
541904            France
541905            France
541906            France
541907            France
541908            France
Name: Country, Length: 541909, dtype: object

In [69]:
print(len("benim adım stephen mi?"))

22

In [70]:
print(len(data["Country"]))

541909

In [72]:
print(data["Country"].str.len())

0         14
1         14
2         14
3         14
4         14
          ..
541904     6
541905     6
541906     6
541907     6
541908     6
Name: Country, Length: 541909, dtype: int64

In [73]:
print("bu nedir arkadas anlamadım".replace("i","e"))

bu neder arkadas anlamadım

In [75]:
data["Country"].str.replace("United Kingdom","UK")

0             UK
1             UK
2             UK
3             UK
4             UK
           ...
541904    France
541905    France
541906    France
541907    France
541908    France
Name: Country, Length: 541909, dtype: object

In [77]:
data["Country"].str.lower().str.contains("kingdom") # hepsini küçük harfe çevirdiğimden dolayı kingdom küçük olarak yazdım.

0          True
1          True
2          True
3          True
4          True
          ...
541904    False
541905    False
541906    False
541907    False
541908    False
Name: Country, Length: 541909, dtype: bool

In [79]:
data["Country"].str.lower().str.startswith("fr")

0         False
1         False
2         False
3         False
4         False
          ...
541904     True
541905     True
541906     True
541907     True
541908     True
Name: Country, Length: 541909, dtype: bool

In [80]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [81]:
data["Country"]

0         United Kingdom
1         United Kingdom
2         United Kingdom
3         United Kingdom
4         United Kingdom
               ...
541904            France
541905            France
541906            France
541907            France
541908            France
Name: Country, Length: 541909, dtype: object

In [84]:
print("    ben kimim b   il iyor musun   .     ".strip())

ben kimim b   il iyor musun   .

In [85]:
print("    ben kimim b   il iyor musun  ?   ")

    ben kimim b   il iyor musun  ?

In [86]:
" ben kimim ne rede ? ".split(" ")

['', 'ben', 'kimim', 'ne', 'rede', '?', '']

In [87]:
data["Country"].str.split(" ")

0         [United, Kingdom]
1         [United, Kingdom]
2         [United, Kingdom]
3         [United, Kingdom]
4         [United, Kingdom]
                ...
541904             [France]
541905             [France]
541906             [France]
541907             [France]
541908             [France]
Name: Country, Length: 541909, dtype: object

In [88]:
data["Country"].str.split(" ").str.get(0)

0         United
1         United
2         United
3         United
4         United
           ...
541904    France
541905    France
541906    France
541907    France
541908    France
Name: Country, Length: 541909, dtype: object

In [89]:
data["Country"].str.split(" ").str.get(1)

0         Kingdom
1         Kingdom
2         Kingdom
3         Kingdom
4         Kingdom
           ...
541904        NaN
541905        NaN
541906        NaN
541907        NaN
541908        NaN
Name: Country, Length: 541909, dtype: object